app/controllers/site_controller.rb

SELECT * FROM "posts"
---
  def blog
  @title="Welcome to WeatheredWatcher::Blog"
  @current_page = "blog"


  @posts = Post.all